socialNetwork/wrk2/user-timeline-without-istio/COMMAND_8/22
Running 1m test @ http://localhost:31111/wrk2-api/post/compose
  2 threads and 16 connections
  Thread calibration: mean lat.: 1490.234ms, rate sampling interval: 6705ms
  Thread calibration: mean lat.: 1456.536ms, rate sampling interval: 6586ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     7.88s     1.89s   11.31s    62.07%
    Req/Sec   193.79     46.82   249.00     64.29%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.49s 
 75.000%    9.58s 
 90.000%   10.85s 
 99.000%   11.31s 
 99.900%   11.56s 
 99.990%   11.61s 
 99.999%   11.62s 
100.000%   11.62s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    4468.735     0.000000            1         1.00
    5693.439     0.100000         1905         1.11
    6201.343     0.200000         3816         1.25
    6504.447     0.300000         5730         1.43
    6811.647     0.400000         7622         1.67
    7491.583     0.500000         9519         2.00
    7852.031     0.550000        10484         2.22
    8093.695     0.600000        11425         2.50
    8544.255     0.650000        12382         2.86
    9084.927     0.700000        13331         3.33
    9584.639     0.750000        14279         4.00
    9822.207     0.775000        14755         4.44
   10027.007     0.800000        15238         5.00
   10239.999     0.825000        15711         5.71
   10518.527     0.850000        16188         6.67
   10739.711     0.875000        16678         8.00
   10797.055     0.887500        16909         8.89
   10854.399     0.900000        17154        10.00
   10903.551     0.912500        17410        11.43
   10944.511     0.925000        17630        13.33
   10985.471     0.937500        17848        16.00
   11010.047     0.943750        17968        17.78
   11034.623     0.950000        18092        20.00
   11067.391     0.956250        18225        22.86
   11091.967     0.962500        18321        26.67
   11132.927     0.968750        18455        32.00
   11149.311     0.971875        18499        35.56
   11173.887     0.975000        18571        40.00
   11190.271     0.978125        18627        45.71
   11214.847     0.981250        18682        53.33
   11239.423     0.984375        18744        64.00
   11255.807     0.985938        18775        71.11
   11272.191     0.987500        18804        80.00
   11288.575     0.989062        18828        91.43
   11329.535     0.990625        18862       106.67
   11354.111     0.992188        18891       128.00
   11370.495     0.992969        18902       142.22
   11395.071     0.993750        18918       160.00
   11411.455     0.994531        18932       182.86
   11427.839     0.995313        18948       213.33
   11444.223     0.996094        18960       256.00
   11460.607     0.996484        18970       284.44
   11468.799     0.996875        18975       320.00
   11493.375     0.997266        18985       365.71
   11509.759     0.997656        18994       426.67
   11517.951     0.998047        18997       512.00
   11534.335     0.998242        19002       568.89
   11542.527     0.998437        19005       640.00
   11550.719     0.998633        19012       731.43
   11550.719     0.998828        19012       853.33
   11567.103     0.999023        19018      1024.00
   11567.103     0.999121        19018      1137.78
   11575.295     0.999219        19022      1280.00
   11575.295     0.999316        19022      1462.86
   11583.487     0.999414        19023      1706.67
   11591.679     0.999512        19026      2048.00
   11591.679     0.999561        19026      2275.56
   11599.871     0.999609        19030      2560.00
   11599.871     0.999658        19030      2925.71
   11599.871     0.999707        19030      3413.33
   11599.871     0.999756        19030      4096.00
   11599.871     0.999780        19030      4551.11
   11608.063     0.999805        19032      5120.00
   11608.063     0.999829        19032      5851.43
   11608.063     0.999854        19032      6826.67
   11608.063     0.999878        19032      8192.00
   11608.063     0.999890        19032      9102.22
   11616.255     0.999902        19033     10240.00
   11616.255     0.999915        19033     11702.86
   11616.255     0.999927        19033     13653.33
   11616.255     0.999939        19033     16384.00
   11616.255     0.999945        19033     18204.44
   11624.447     0.999951        19034     20480.00
   11624.447     1.000000        19034          inf
#[Mean    =     7882.319, StdDeviation   =     1893.273]
#[Max     =    11616.256, Total count    =        19034]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  21712 requests in 1.00m, 4.45MB read
  Socket errors: connect 0, read 0, write 0, timeout 45
Requests/sec:    361.87
Transfer/sec:     75.98KB